# Дано два дійсних числа. З’ясувати, чи належать ці числа інтервалу [1,2]u(3,7) .

a = float(input('I число: '))
b = float(input('II число: '))

if a >= 1 and a <= 2:
    print('I число входить до інтервалу')
elif a > 3 and a < 7:
    print('I число входить до інтервалу')
else:
    print('I число входить не до інтервалу')

if b >= 1 and b <= 2:
    print('II число входить до інтервалу')
elif b > 3 and b < 7:
    print('II число входить до інтервалу')
else:
    print('II число входить не до інтервалу')